---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ReinforcementAreaPerUnitLength
source: html/52dfc5e7-d3d4-75c6-fe99-978ced9e66a9.htm
---
# Autodesk.Revit.DB.SpecTypeId.ReinforcementAreaPerUnitLength Property

Reinforcement Area per Unit Length, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId ReinforcementAreaPerUnitLength { get; }
```